Repository: alight659/ClipBin
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pt_br

source: Home
pt_br: Início

source: Search
pt_br: Pesquisar

source: Dashboard
pt_br: Painel

source: About
pt_br: Sobre

source: Language
pt_br: Idioma

source: Signed in as
pt_br: Conectado como

source: Logout
pt_br: Sair

source: Register
pt_br: Registrar

source: Login
pt_br: Entrar

source: Terms and Privacy
pt_br: Termos e Privacidade

source: Share Code or Text Instantly
pt_br: Compartilhe código ou texto instantaneamente

source: Create a Clip
pt_br: Criar um clip

source: Dump your code or whatever you want.
pt_br: Compartilhe seu código ou qualquer texto.

source: Enter title
pt_br: Informe o título

source: Hello Title
pt_br: Olá título

source: Enter your text
pt_br: Digite seu texto

source: Something interesting...
pt_br: Algo interessante...

source: --OR--
pt_br: --OU--

source: Upload file?
pt_br: Enviar arquivo?

source: Optional settings
pt_br: Opções adicionais

source: Custom alias (a-z A-Z 0-9 -_ only)
pt_br: Alias personalizado (a-z A-Z 0-9 -_ apenas)

source: Create a password protected clip
pt_br: Criar um clip protegido por senha

source: Enter password
pt_br: Digite a senha

source: Using a password also enables E2EE.
pt_br: Usar uma senha também ativa a criptografia de ponta a ponta.

source: Remove after:
pt_br: Remover após:

source: Never
pt_br: Nunca

source: 1 day
pt_br: 1 dia

source: 1 week
pt_br: 1 semana

source: 2 weeks
pt_br: 2 semanas

source: 1 month
pt_br: 1 mês

source: 6 months
pt_br: 6 meses

source: 1 year
pt_br: 1 ano

source: Custom
pt_br: Personalizado

source: Or enter custom delete time (hours):
pt_br: Ou informe o tempo de exclusão personalizado (horas):

source: e.g., 1 for 1 hour
pt_br: ex.: 1 para 1 hora

source: Make editable? (requires login)
pt_br: Permitir edição? (requer login)

source: Set unlisted?
pt_br: Definir como não listado?

source: Save
pt_br: Salvar

source: Password protected clip
pt_br: Clip protegido por senha

source: Submit
pt_br: Enviar

source: URL copied!
pt_br: URL copiada!

source: Copy URL
pt_br: Copiar URL

source: Download as %(extension)s
pt_br: Baixar como %(extension)s

source: Create another
pt_br: Criar outro

source: View raw
pt_br: Ver bruto

source: This clip can be edited by the owner.
pt_br: Este clip pode ser editado pelo proprietário.

source: Update
pt_br: Atualizar

source: Created: %(timestamp)s UTC
pt_br: Criado: %(timestamp)s UTC

source: Updated: %(timestamp)s UTC
pt_br: Atualizado: %(timestamp)s UTC

source: Time left until expiration: %(time_left)s
pt_br: Tempo restante até expirar: %(time_left)s

source: Search a clip
pt_br: Pesquisar um clip

source: Enter clip name or URL ID
pt_br: Informe o nome do clip ou o ID da URL

source: Name
pt_br: Nome

source: Clip ID
pt_br: ID do clip

source: Created at
pt_br: Criado em

source: Open
pt_br: Abrir

source: Welcome %(username)s
pt_br: Bem-vindo, %(username)s

source: Here are the clips you created.
pt_br: Aqui estão os clips que você criou.

source: Editable?
pt_br: Editável?

source: Unlisted?
pt_br: Não listado?

source: Delete
pt_br: Excluir

source: Nothing here...
pt_br: Nada por aqui...

source: Start creating?
pt_br: Começar a criar?

source: Settings
pt_br: Configurações

source: Change password
pt_br: Alterar senha

source: Current password
pt_br: Senha atual

source: New password
pt_br: Nova senha

source: Confirm password
pt_br: Confirmar senha

source: Data export
pt_br: Exportação de dados

source: Data export currently does not support encrypted clips. Only unencrypted clips will be included.
pt_br: A exportação de dados não suporta clips criptografados. Apenas clips sem senha serão incluídos.

source: Select export format:
pt_br: Selecione o formato de exportação:

source: Text
pt_br: Texto

source: Export
pt_br: Exportar

source: Dive right into the simplest way of sharing code.
pt_br: Mergulhe na forma mais simples de compartilhar código.

source: Success!
pt_br: Sucesso!

source: Username
pt_br: Nome de usuário

source: Password
pt_br: Senha

source: Don't have an account? Register here.
pt_br: Não tem uma conta? Registre-se aqui.

source: The simplest way of sharing code or anything that is text.
pt_br: A forma mais simples de compartilhar código ou qualquer texto.

source: Features
pt_br: Recursos

source: Dark mode
pt_br: Modo escuro

source: Anonymous
pt_br: Anônimo

source: Password protected clips
pt_br: Clips protegidos por senha

source: Full CRUD support
pt_br: Suporte completo a CRUD

source: Login/Sign-up features
pt_br: Recursos de login/cadastro

source: Dashboard features
pt_br: Recursos do painel

source: Open API
pt_br: API aberta

source: Custom URL alias
pt_br: Alias de URL personalizado

source: Temporary time-based clips
pt_br: Clips temporários

source: Error
pt_br: Erro

source: API documentation
pt_br: Documentação da API

source: API information
pt_br: Informações da API

source: This API allows users to retrieve and add data to ClipBin. It includes two primary functions: get_data (GET request) and post_data (POST request).
pt_br: Esta API permite recuperar e adicionar dados ao ClipBin. Ela inclui duas funções principais: get_data (requisição GET) e post_data (requisição POST).

source: Retrieve data from the database based on specific parameters.
pt_br: Recupere dados do banco com base em parâmetros específicos.

source: Method:
pt_br: Método:

source: Description:
pt_br: Descrição:

source: Query parameters
pt_br: Parâmetros de consulta

source: Parameter
pt_br: Parâmetro

source: Type
pt_br: Tipo

source: Required
pt_br: Obrigatório

source: Description
pt_br: Descrição

source: string
pt_br: texto

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: The unique identifier for the data.
pt_br: O identificador único do dado.

source: The name associated with the data.
pt_br: O nome associado ao dado.

source: The password for authorization.
pt_br: A senha para autorização.

source: Filter for unlisted data. Accepted values: true or false.
pt_br: Filtro para dados não listados. Valores aceitos: true ou false.

source: Responses
pt_br: Respostas

source: 200 OK: Successfully retrieved data.
pt_br: 200 OK: Dados recuperados com sucesso.

source: 400 Bad Request: Missing or incorrect request parameters.
pt_br: 400 Requisição inválida: parâmetros ausentes ou incorretos.

source: 401 Unauthorized: Authentication failed (incorrect pwd).
pt_br: 401 Não autorizado: falha na autenticação (senha incorreta).

source: 404 Not Found: No data found.
pt_br: 404 Não encontrado: nenhum dado localizado.

source: Example request
pt_br: Exemplo de requisição

source: Add new data to the database.
pt_br: Adiciona novos dados ao banco.

source: Adds new data to the database with the provided details.
pt_br: Adiciona novos dados ao banco com os detalhes fornecidos.

source: Request parameters
pt_br: Parâmetros da requisição

source: The text content to be stored.
pt_br: O conteúdo de texto a ser armazenado.

source: The password for protecting the data.
pt_br: A senha para proteger o dado.

source: Specify if the data should be unlisted. Accepted values: true or false.
pt_br: Informe se o dado deve ser não listado. Valores aceitos: true ou false.

source: Specify when the clip will be removed. Available options:
pt_br: Informe quando o clip será removido. Opções disponíveis:

source: day - for 1 day
pt_br: day - por 1 dia

source: week - for 1 week
pt_br: week - por 1 semana

source: twoweek - for 2 week
pt_br: twoweek - por 2 semanas

source: month - for 1 month
pt_br: month - por 1 mês

source: half - for 6 month
pt_br: half - por 6 meses

source: year - for 1 year
pt_br: year - por 1 ano

source: If any other option is provided, it will be treated as never.
pt_br: Se outra opção for informada, será considerada como nunca.

source: Body Example:
pt_br: Exemplo de corpo:

source: 201 Created: Successfully added data.
pt_br: 201 Criado: dados adicionados com sucesso.

source: 400 Bad Request: Missing parameters or failed to add data.
pt_br: 400 Requisição inválida: parâmetros ausentes ou falha ao adicionar dados.

source: Example response
pt_br: Exemplo de resposta

source: Feedback is welcome. Please share your experience with us at
pt_br: Feedback é bem-vindo. Compartilhe sua experiência conosco em

source: The developer may be referred to as I, we, or our. ClipBin may be referred to by name, or simply 'this'.
pt_br: O desenvolvedor pode ser referido como eu, nós ou nosso. ClipBin pode ser referido pelo nome ou simplesmente como 'este'.

source: The API is open. You are free to use it for any lawful purpose.
pt_br: A API é aberta. Você pode usá-la para qualquer finalidade legal.

source: For any queries related to terms and privacy, please email
pt_br: Para dúvidas sobre termos e privacidade, envie um e-mail para
